//Файл описывает реализации методов базового класса------------------------------//
//Переменные которые можно(нужно) использовать описаны в Base.h------------------//
#include <iostream>
#include "Base.h"
//Реализация общего для ВСЕХ класов метода открытия диска------------------------//
//-------------------------------------------------------------------------------//
HANDLE Base::getFileHandle() 
{
	// Функция возвращает файловый дескриптор по указанному пути //
	file_handle = CreateFileW(
		path,
		GENERIC_READ | GENERIC_WRITE,
		FILE_SHARE_READ | FILE_SHARE_WRITE,
		NULL,
		OPEN_EXISTING,
		0,
		NULL);
	// Обработчик ошибок при открытии логического диска //
	if (file_handle == INVALID_HANDLE_VALUE) 
	{
		std::cout << "Can't open file with error code: " << GetLastError() << '\n';
		return file_handle;
	}
	else
	{
		return file_handle;
	}
};
//Реализация конструктора и деструктора класса-----------------------------------//
//-------------------------------------------------------------------------------//
Base::Base(WCHAR* file_path)
{
	// Указываем путь до файла, при инициализации класса //
	path = file_path;
	cluster_size = NULL;
	file_handle = NULL;
}
Base::~Base()
{

}
//-------------------------------------------------------------------------------//
//-------------------------------------------------------------------------------//