//Файл описывает переменный и прототипы методов базового класса------------------//
//Переменные которые можно(нужно) использовать описаны в Base.h------------------//
#pragma once
#include <windows.h>

class Base {
public:
//Описание констант и переменных используемых в классе И его наследниках---------//
//-------------------------------------------------------------------------------//
	const int sector_size = 512;	// Размер сектора
	WCHAR* path;					// Путь до файла
	int cluster_size;				// Размер кластера (НЕ кластерный множитель)
	HANDLE file_handle;				// Дескриптор файла
//Прототипы методов базового класса----------------------------------------------//
//-------------------------------------------------------------------------------//
	virtual void getClusterData(
		HANDLE file_handle,
		unsigned int cluster_number,
		BYTE* read_buffer) = 0;
	virtual int getClusterSize(HANDLE file_handle) = 0;
	HANDLE getFileHandle();
//Прототипы конструктора и деструктора базового класса---------------------------//
//-------------------------------------------------------------------------------//
	Base(WCHAR* file_path);
	Base();							// Стандартный констуктор
	~Base();
};
//-------------------------------------------------------------------------------//
//-------------------------------------------------------------------------------//