//Файл описывает переменные и прототипы методов класса NTFS----------------------//
//Переменные которые можно(нужно) использовать описаны в Base.h------------------//
#pragma once
#include "Base.h"

class EXT4 :
    public Base
{
public:
    //Прототипы переопределенных функций класса наседника----------------------------//
    //-------------------------------------------------------------------------------//
    int getClusterSize(HANDLE file_handle);
    void getClusterData(
        HANDLE file_handle,
        unsigned int cluster_number,
        BYTE* read_buffer);
    //Прототипы переопределенных функций класса наседника----------------------------//
    //-------------------------------------------------------------------------------//
    EXT4(WCHAR* file_path);
    ~EXT4();
};
//-------------------------------------------------------------------------------//
//-------------------------------------------------------------------------------//
