#pragma once
#include "Base.h"
class FAT32 :
	public Base
{
public:
//Ïðîòîòèïû ìåòîäîâ áàçîâîãî êëàññà----------------------------------------------//
//-------------------------------------------------------------------------------//
	void getClusterData(
		ULONGLONG cluster_number,
		BYTE* read_buffer);

	int getClusterInfo();
	ULONGLONG cluster_begin;

//Ïðîòîòèïû êîíñòðóêòîðà è äåñòðóêòîðà áàçîâîãî êëàññà---------------------------//
//-------------------------------------------------------------------------------//
	FAT32(WCHAR* file_path);
	~FAT32();
};
//-------------------------------------------------------------------------------//
//-------------------------------------------------------------------------------//


