#pragma once
#include "Base.h"
class FAT32 :
	public Base
{
public:
//ѕрототипы методов базового класса----------------------------------------------//
//-------------------------------------------------------------------------------//
	void getClusterData(
		unsigned int cluster_number,
		BYTE* read_buffer);

	int getClusterSize();

//ѕрототипы конструктора и деструктора базового класса---------------------------//
//-------------------------------------------------------------------------------//
	FAT32(WCHAR* file_path);
	~FAT32();
};
//-------------------------------------------------------------------------------//
//-------------------------------------------------------------------------------//


