//Файл описывает переменные и прототипы методов класса NTFS----------------------//
//Переменные которые можно(нужно) использовать описаны в Base.h------------------//
#pragma once
#include "Base.h"

class NTFS :
    public Base
{
public:
//Прототипы переопределенных функций класса наседника----------------------------//
//-------------------------------------------------------------------------------//
    int getClusterSize();
    void getClusterData( 
        unsigned int cluster_number,
        BYTE* read_buffer);
//Прототипы переопределенных функций класса наседника----------------------------//
//-------------------------------------------------------------------------------//
    NTFS(WCHAR* file_path);
    ~NTFS();
};
//-------------------------------------------------------------------------------//
//-------------------------------------------------------------------------------//
